milindur/hal_nxp/s32/mcux/devices/S32K358/S32K358_device.h
#define CAN_ERFSR_ERFOVF_MASK  (0x40000000U)
#define CAN_ERFSR_ERFOVF_SHIFT (30U)
/*! ERFOVF - Enhanced Rx FIFO Overflow
 *  0b0..No such occurrence
 *  0b1..Enhanced Rx FIFO overflow
 */
#define CAN_ERFSR_ERFOVF(x) (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFOVF_SHIFT)) & CAN_ERFSR_ERFOVF_MASK)

#define CAN_ERFSR_ERFUFW_MASK  (0x80000000U)
#define CAN_ERFSR_ERFUFW_SHIFT (31U)
/*! ERFUFW - Enhanced Rx FIFO Underflow
 *  0b0..No such occurrence
 *  0b1..Enhanced Rx FIFO underflow
 */
#define CAN_ERFSR_ERFUFW(x) (((uint32_t)(((uint32_t)(x)) << CAN_ERFSR_ERFUFW_SHIFT)) & CAN_ERFSR_ERFUFW_MASK)
/*! @} */

/*! @name HR_TIME_STAMP - High Resolution Time Stamp */
/*! @{ */

#define CAN_HR_TIME_STAMP_TS_MASK  (0xFFFFFFFFU)
#define CAN_HR_TIME_STAMP_TS_SHIFT (0U)
/*! TS - High Resolution Time Stamp
 */
#define CAN_HR_TIME_STAMP_TS(x) \
    (((uint32_t)(((uint32_t)(x)) << CAN_HR_TIME_STAMP_TS_SHIFT)) & CAN_HR_TIME_STAMP_TS_MASK)
/*! @} */

/* The count of CAN_HR_TIME_STAMP */
#define CAN_HR_TIME_STAMP_COUNT (96U)

/*! @name ERFFEL - Enhanced Rx FIFO Filter Element */
/*! @{ */

#define CAN_ERFFEL_FEL_MASK  (0xFFFFFFFFU)
#define CAN_ERFFEL_FEL_SHIFT (0U)
/*! FEL - Filter Element Bits
 */
#define CAN_ERFFEL_FEL(x) (((uint32_t)(((uint32_t)(x)) << CAN_ERFFEL_FEL_SHIFT)) & CAN_ERFFEL_FEL_MASK)
/*! @} */

/* The count of CAN_ERFFEL */
#define CAN_ERFFEL_COUNT (128U)

/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */
/** DMA - Register Layout Typedef */
typedef struct
{
    __IO uint32_t MP_CSR; /**< Management Page Control, offset: 0x0 */
    __I uint32_t MP_ES;   /**< Management Page Error Status, offset: 0x4 */
    __I uint32_t MP_INT;  /**< Management Page Interrupt Request Status, offset: 0x8 */
    __I uint32_t MP_HRS;  /**< Management Page Hardware Request Status, offset: 0xC */
    uint8_t RESERVED_0[240];
    __IO uint32_t CH_GRPRI[32]; /**< Channel Arbitration Group, array offset: 0x100, array step: 0x4 */
    uint8_t RESERVED_1[16000];
    struct
    {                         /* offset: 0x4000, array step: 0x10000 */
        __IO uint32_t CH_CSR; /**< Channel Control and Status, array offset: 0x10000, array step: 0x10000 */
        __IO uint32_t CH_ES;  /**< Channel Error Status, array offset: 0x10004, array step: 0x10000 */
        __IO uint32_t CH_INT; /**< Channel Interrupt Status, array offset: 0x10008, array step: 0x10000 */
        __IO uint32_t CH_SBR; /**< Channel System Bus, array offset: 0x1000C, array step: 0x10000 */
        __IO uint32_t CH_PRI; /**< Channel Priority, array offset: 0x10010, array step: 0x10000 */
        uint8_t RESERVED_0[12];
        __IO uint32_t TCD_SADDR; /**< TCD Source Address, array offset: 0x10020, array step: 0x10000 */
        __IO uint16_t TCD_SOFF;  /**< TCD Signed Source Address Offset, array offset: 0x10024, array step: 0x10000 */
        __IO uint16_t TCD_ATTR;  /**< TCD Transfer Attributes, array offset: 0x10026, array step: 0x10000 */
        union
        {                                      /* offset: 0x10028, array step: 0x10000 */
            __IO uint32_t TCD_NBYTES_MLOFFNO;  /**< TCD Transfer Size Without Minor Loop Offsets, array offset: 0x10028,
                                                  array step: 0x10000 */
            __IO uint32_t TCD_NBYTES_MLOFFYES; /**< TCD Transfer Size with Minor Loop Offsets, array offset: 0x10028,
                                                  array step: 0x10000 */
        };
        __IO uint32_t TCD_SLAST_SDA; /**< TCD Last Source Address Adjustment / Store DADDR Address, array offset:
                                        0x1002C, array step: 0x10000 */
        __IO uint32_t TCD_DADDR;     /**< TCD Destination Address, array offset: 0x10030, array step: 0x10000 */
        __IO uint16_t TCD_DOFF; /**< TCD Signed Destination Address Offset, array offset: 0x10034, array step: 0x10000 */
        union
        {                                     /* offset: 0x10036, array step: 0x10000 */
            __IO uint16_t TCD_CITER_ELINKNO;  /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled),
                                                 array offset: 0x10036, array step: 0x10000 */
            __IO uint16_t TCD_CITER_ELINKYES; /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled),
                                                 array offset: 0x10036, array step: 0x10000 */
        };
        __IO uint32_t TCD_DLAST_SGA; /**< TCD Last Destination Address Adjustment / Scatter Gather Address, array
                                        offset: 0x10038, array step: 0x10000 */
        __IO uint16_t TCD_CSR;       /**< TCD Control and Status, array offset: 0x1003C, array step: 0x10000 */
        union
        {                                     /* offset: 0x1003E, array step: 0x10000 */
            __IO uint16_t TCD_BITER_ELINKNO;  /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled),
                                                 array offset: 0x1003E, array step: 0x10000 */
            __IO uint16_t TCD_BITER_ELINKYES; /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled),
                                                 array offset: 0x1003E, array step: 0x10000 */
        };
        uint8_t RESERVED_1[16320];
    } CH[148]; /* Channels from 12 -> 127 are offset channels */
} DMA_Type;

#define DMA_MP_CSR_EDBG_MASK                eDMA_CSR_EDBG_MASK
#define DMA_MP_CSR_EDBG_SHIFT               eDMA_CSR_EDBG_SHIFT

#define DMA_MP_CSR_EDBG(x)                  eDMA_CSR_EDBG(x)

#define DMA_MP_CSR_ERCA_MASK                eDMA_CSR_ERCA_MASK
#define DMA_MP_CSR_ERCA_SHIFT               eDMA_CSR_ERCA_SHIFT
#define DMA_MP_CSR_ERCA(x)                  eDMA_CSR_ERCA(x)

#define DMA_MP_CSR_HAE_MASK                 eDMA_CSR_HAE_MASK
#define DMA_MP_CSR_HAE_SHIFT                eDMA_CSR_HAE_SHIFT
#define DMA_MP_CSR_HAE(x)                   eDMA_CSR_HAE(x)

#define DMA_MP_CSR_HALT_MASK                eDMA_CSR_HALT_MASK
#define DMA_MP_CSR_HALT_SHIFT               eDMA_CSR_HALT_SHIFT
#define DMA_MP_CSR_HALT(x)                  eDMA_CSR_HALT(x)

#define DMA_MP_CSR_GCLC_MASK                eDMA_CSR_GCLC_MASK
#define DMA_MP_CSR_GCLC_SHIFT               eDMA_CSR_GCLC_SHIFT
#define DMA_MP_CSR_GCLC(x)                  eDMA_CSR_GCLC(x)

