milindur/hal_nxp/s32/mcux/devices/S32K358/S32K358_device.h
#define DMA_MP_CSR_GMRC_MASK                eDMA_CSR_GMRC_MASK
#define DMA_MP_CSR_GMRC_SHIFT               eDMA_CSR_GMRC_SHIFT
#define DMA_MP_CSR_GMRC(x)                  eDMA_CSR_GMRC(x)

#define DMA_MP_CSR_ECX_MASK                 eDMA_CSR_ECX_MASK
#define DMA_MP_CSR_ECX_SHIFT                eDMA_CSR_ECX_SHIFT
#define DMA_MP_CSR_ECX(x)                   eDMA_CSR_ECX(x)

#define DMA_MP_CSR_CX_MASK                  eDMA_CSR_CX_MASK
#define DMA_MP_CSR_CX_SHIFT                 eDMA_CSR_CX_SHIFT
#define DMA_MP_CSR_CX(x)                    eDMA_CSR_CX(x)

#define DMA_MP_CSR_ACTIVE_ID_MASK           eDMA_CSR_ACTIVE_ID_MASK
#define DMA_MP_CSR_ACTIVE_ID_SHIFT          eDMA_CSR_ACTIVE_ID_SHIFT
#define DMA_MP_CSR_ACTIVE_ID(x)             eDMA_CSR_ACTIVE_ID(x)

#define DMA_MP_CSR_ACTIVE_MASK              eDMA_CSR_ACTIVE_MASK
#define DMA_MP_CSR_ACTIVE_SHIFT             eDMA_CSR_ACTIVE_SHIFT
#define DMA_MP_CSR_ACTIVE(x)                eDMA_CSR_ACTIVE(x)
/*! @} */

/*! @name MP_ES - Management Page Error Status */
/*! @{ */

#define DMA_MP_ES_DBE_MASK                  eDMA_ES_DBE_MASK
#define DMA_MP_ES_DBE_SHIFT                 eDMA_ES_DBE_SHIFT
#define DMA_MP_ES_DBE(x)                    eDMA_ES_DBE(x)

#define DMA_MP_ES_SBE_MASK                  eDMA_ES_SBE_MASK
#define DMA_MP_ES_SBE_SHIFT                 eDMA_ES_SBE_SHIFT
#define DMA_MP_ES_SBE(x)                    eDMA_ES_SBE(x)

#define DMA_MP_ES_SGE_MASK                  eDMA_ES_SGE_MASK
#define DMA_MP_ES_SGE_SHIFT                 eDMA_ES_SGE_SHIFT
#define DMA_MP_ES_SGE(x)                    eDMA_ES_SGE(x)

#define DMA_MP_ES_NCE_MASK                  eDMA_ES_NCE_MASK
#define DMA_MP_ES_NCE_SHIFT                 eDMA_ES_NCE_SHIFT
#define DMA_MP_ES_NCE(x)                    eDMA_ES_NCE(x)

#define DMA_MP_ES_DOE_MASK                  eDMA_ES_DOE_MASK
#define DMA_MP_ES_DOE_SHIFT                 eDMA_ES_DOE_SHIFT
#define DMA_MP_ES_DOE(x)                    eDMA_ES_DOE(x)

#define DMA_MP_ES_DAE_MASK                  eDMA_ES_DAE_MASK
#define DMA_MP_ES_DAE_SHIFT                 eDMA_ES_DAE_SHIFT
#define DMA_MP_ES_DAE(x)                    eDMA_ES_DAE(x)

#define DMA_MP_ES_SOE_MASK                  eDMA_ES_SOE_MASK
#define DMA_MP_ES_SOE_SHIFT                 eDMA_ES_SOE_SHIFT
#define DMA_MP_ES_SOE(x)                    eDMA_ES_SOE(x)

#define DMA_MP_ES_SAE_MASK                  eDMA_ES_SAE_MASK
#define DMA_MP_ES_SAE_SHIFT                 eDMA_ES_SAE_SHIFT
#define DMA_MP_ES_SAE(x)                    eDMA_ES_SAE(x)

#define DMA_MP_ES_ECX_MASK                  eDMA_ES_ECX_MASK
#define DMA_MP_ES_ECX_SHIFT                 eDMA_ES_ECX_SHIFT
#define DMA_MP_ES_ECX(x)                    eDMA_ES_ECX(x)

#define DMA_MP_ES_ERRCHN_MASK               eDMA_ES_ERRCHN_MASK
#define DMA_MP_ES_ERRCHN_SHIFT              eDMA_ES_ERRCHN_SHIFT
#define DMA_MP_ES_ERRCHN(x)                 eDMA_ES_ERRCHN(x)

#define DMA_MP_ES_VLD_MASK                  eDMA_ES_VLD_MASK
#define DMA_MP_ES_VLD_SHIFT                 eDMA_ES_VLD_SHIFT
#define DMA_MP_ES_VLD(x)                    eDMA_ES_VLD(x)

/*! @} */

/*! @name MP_INT - Management Page Interrupt Request Status */
/*! @{ */

#define DMA_MP_INT_INT_MASK                 eDMA_INT_INT_MASK
#define DMA_MP_INT_INT_SHIFT                eDMA_INT_INT_SHIFT
#define DMA_MP_INT_INT(x)                   eDMA_INT_INT(x)

/*! @} */

/*! @name MP_HRS - Management Page Hardware Request Status */
/*! @{ */

#define DMA_MP_HRS_HRS_MASK                 eDMA_HRS_HRS_MASK
#define DMA_MP_HRS_HRS_SHIFT                eDMA_HRS_HRS_SHIFT
#define DMA_MP_HRS_HRS(x)                   eDMA_HRS_HRS(x)
/*! @} */

/*! @name CH_GRPRI - Channel Arbitration Group */
/*! @{ */

#define DMA_CH_GRPRI_GRPRI_MASK             eDMA_CH_GRPRI_GRPRI_MASK
#define DMA_CH_GRPRI_GRPRI_SHIFT            eDMA_CH_GRPRI_GRPRI_SHIFT
#define DMA_CH_GRPRI_GRPRI(x)               eDMA_CH_GRPRI_GRPRI(x)
/*! @} */

/*! @name CH_CSR - Channel Control and Status */
/*! @{ */

#define DMA_CH_CSR_ERQ_MASK                 DMA_TCD_CH0_CSR_ERQ_MASK
#define DMA_CH_CSR_ERQ_SHIFT                DMA_TCD_CH0_CSR_ERQ_SHIFT
#define DMA_CH_CSR_ERQ(x)                   DMA_TCD_CH0_CSR_ERQ(x)

#define DMA_CH_CSR_EARQ_MASK                DMA_TCD_CH0_CSR_EARQ_MASK
#define DMA_CH_CSR_EARQ_SHIFT               DMA_TCD_CH0_CSR_EARQ_SHIFT
#define DMA_CH_CSR_EARQ(x)                  DMA_TCD_CH0_CSR_EARQ(x)

#define DMA_CH_CSR_EEI_MASK                 DMA_TCD_CH0_CSR_EEI_MASK
#define DMA_CH_CSR_EEI_SHIFT                DMA_TCD_CH0_CSR_EEI_SHIFT
#define DMA_CH_CSR_EEI(x)                   DMA_TCD_CH0_CSR_EEI(x)

#define DMA_CH_CSR_EBW_MASK                 DMA_TCD_CH0_CSR_EBW_MASK
#define DMA_CH_CSR_EBW_SHIFT                DMA_TCD_CH0_CSR_EBW_SHIFT
#define DMA_CH_CSR_EBW(x)                   DMA_TCD_CH0_CSR_EBW(x)

#define DMA_CH_CSR_DONE_MASK                DMA_TCD_CH0_CSR_DONE_MASK
#define DMA_CH_CSR_DONE_SHIFT               DMA_TCD_CH0_CSR_DONE_SHIFT
#define DMA_CH_CSR_DONE(x)                  DMA_TCD_CH0_CSR_DONE(x)

#define DMA_CH_CSR_ACTIVE_MASK              DMA_TCD_CH0_CSR_ACTIVE_MASK
#define DMA_CH_CSR_ACTIVE_SHIFT             DMA_TCD_CH0_CSR_ACTIVE_SHIFT
#define DMA_CH_CSR_ACTIVE(x)                DMA_TCD_CH0_CSR_ACTIVE(x)
/*! @} */

/*! @name CH_ES - Channel Error Status */
/*! @{ */

#define DMA_CH_ES_DBE_MASK                  DMA_TCD_CH0_ES_DBE_MASK
#define DMA_CH_ES_DBE_SHIFT                 DMA_TCD_CH0_ES_DBE_SHIFT
#define DMA_CH_ES_DBE(x)                    DMA_TCD_CH0_ES_DBE(x)

#define DMA_CH_ES_SBE_MASK                  DMA_TCD_CH0_ES_SBE_MASK
#define DMA_CH_ES_SBE_SHIFT                 DMA_TCD_CH0_ES_SBE_SHIFT
#define DMA_CH_ES_SBE(x)                    DMA_TCD_CH0_ES_SBE(x)

#define DMA_CH_ES_SGE_MASK                  DMA_TCD_CH0_ES_SGE_MASK
#define DMA_CH_ES_SGE_SHIFT                 DMA_TCD_CH0_ES_SGE_SHIFT
#define DMA_CH_ES_SGE(x)                    DMA_TCD_CH0_ES_SGE(x)

#define DMA_CH_ES_NCE_MASK                  DMA_TCD_CH0_ES_NCE_MASK
#define DMA_CH_ES_NCE_SHIFT                 DMA_TCD_CH0_ES_NCE_SHIFT
#define DMA_CH_ES_NCE(x)                    DMA_TCD_CH0_ES_NCE(x)

#define DMA_CH_ES_DOE_MASK                  DMA_TCD_CH0_ES_DOE_MASK
#define DMA_CH_ES_DOE_SHIFT                 DMA_TCD_CH0_ES_DOE_SHIFT
#define DMA_CH_ES_DOE(x)                    DMA_TCD_CH0_ES_DOE(x)

#define DMA_CH_ES_DAE_MASK                  DMA_TCD_CH0_ES_DAE_MASK
#define DMA_CH_ES_DAE_SHIFT                 DMA_TCD_CH0_ES_DAE_SHIFT
#define DMA_CH_ES_DAE(x)                    DMA_TCD_CH0_ES_DAE(x)

#define DMA_CH_ES_SOE_MASK                  DMA_TCD_CH0_ES_SOE_MASK
#define DMA_CH_ES_SOE_SHIFT                 DMA_TCD_CH0_ES_SOE_SHIFT
#define DMA_CH_ES_SOE(x)                    DMA_TCD_CH0_ES_SOE(x)

#define DMA_CH_ES_SAE_MASK                  DMA_TCD_CH0_ES_SAE_MASK
#define DMA_CH_ES_SAE_SHIFT                 DMA_TCD_CH0_ES_SAE_SHIFT
#define DMA_CH_ES_SAE(x)                    DMA_TCD_CH0_ES_SAE(x)

#define DMA_CH_ES_ERR_MASK                  DMA_TCD_CH0_ES_ERR_MASK
#define DMA_CH_ES_ERR_SHIFT                 DMA_TCD_CH0_ES_ERR_SHIFT
#define DMA_CH_ES_ERR(x)                    DMA_TCD_CH0_ES_ERR(x)
/*! @} */

/*! @name CH_INT - Channel Interrupt Status */
/*! @{ */

#define DMA_CH_INT_INT_MASK                 DMA_TCD_CH0_INT_INT_MASK
#define DMA_CH_INT_INT_SHIFT                DMA_TCD_CH0_INT_INT_SHIFT
#define DMA_CH_INT_INT(x)                   DMA_TCD_CH0_INT_INT(x)
/*! @} */

/*! @name CH_SBR - Channel System Bus */
/*! @{ */

#define DMA_CH_SBR_MID_MASK                 DMA_TCD_CH0_SBR_MID_MASK
#define DMA_CH_SBR_MID_SHIFT                DMA_TCD_CH0_SBR_MID_SHIFT
#define DMA_CH_SBR_MID(x)                   DMA_TCD_CH0_SBR_MID(x)

#define DMA_CH_SBR_PAL_MASK                 DMA_TCD_CH0_SBR_PAL_MASK
#define DMA_CH_SBR_PAL_SHIFT                DMA_TCD_CH0_SBR_PAL_SHIFT
#define DMA_CH_SBR_PAL(x)                   DMA_TCD_CH0_SBR_PAL(x)

#define DMA_CH_SBR_EMI_MASK                 DMA_TCD_CH0_SBR_EMI_MASK
#define DMA_CH_SBR_EMI_SHIFT                DMA_TCD_CH0_SBR_EMI_SHIFT
#define DMA_CH_SBR_EMI(x)                   DMA_TCD_CH0_SBR_EMI(x)

#define DMA_CH_SBR_ATTR_MASK                DMA_TCD_CH0_SBR_ATTR_MASK
#define DMA_CH_SBR_ATTR_SHIFT               DMA_TCD_CH0_SBR_ATTR_SHIFT
#define DMA_CH_SBR_ATTR(x)                  DMA_TCD_CH0_SBR_ATTR(x)
/*! @} */

/*! @name CH_PRI - Channel Priority */
/*! @{ */

#define DMA_CH_PRI_APL_MASK                 DMA_TCD_CH0_PRI_APL_MASK
#define DMA_CH_PRI_APL_SHIFT                DMA_TCD_CH0_PRI_APL_SHIFT
#define DMA_CH_PRI_APL(x)                   DMA_TCD_CH0_PRI_APL(x)

#define DMA_CH_PRI_DPA_MASK                 DMA_TCD_CH0_PRI_DPA_MASK
#define DMA_CH_PRI_DPA_SHIFT                DMA_TCD_CH0_PRI_DPA_SHIFT
#define DMA_CH_PRI_DPA(x)                   DMA_TCD_CH0_PRI_DPA(x)

