milindur/hal_nxp/s32/mcux/devices/S32K358/S32K358_device.h
#define DMA_CH_PRI_ECP_MASK                 DMA_TCD_CH0_PRI_ECP_MASK
#define DMA_CH_PRI_ECP_SHIFT                DMA_TCD_CH0_PRI_ECP_SHIFT
#define DMA_CH_PRI_ECP(x)                   DMA_TCD_CH0_PRI_ECP(x)
/*! @} */

/*! @name TCD_SADDR - TCD Source Address */
/*! @{ */

#define DMA_TCD_SADDR_SADDR_MASK            DMA_TCD_TCD0_SADDR_SADDR_MASK
#define DMA_TCD_SADDR_SADDR_SHIFT           DMA_TCD_TCD0_SADDR_SADDR_SHIFT
#define DMA_TCD_SADDR_SADDR(x)              DMA_TCD_TCD0_SADDR_SADDR(x)
/*! @} */

/*! @name TCD_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define DMA_TCD_SOFF_SOFF_MASK              DMA_TCD_TCD0_SOFF_SOFF_MASK
#define DMA_TCD_SOFF_SOFF_SHIFT             DMA_TCD_TCD0_SOFF_SOFF_SHIFT
#define DMA_TCD_SOFF_SOFF(x)                DMA_TCD_TCD0_SOFF_SOFF(x)
/*! @} */

/*! @name TCD_ATTR - TCD Transfer Attributes */
/*! @{ */

#define DMA_TCD_ATTR_DSIZE_MASK             DMA_TCD_TCD0_ATTR_DSIZE_MASK
#define DMA_TCD_ATTR_DSIZE_SHIFT            DMA_TCD_TCD0_ATTR_DSIZE_SHIFT
#define DMA_TCD_ATTR_DSIZE(x)               DMA_TCD_TCD0_ATTR_DSIZE(x)

#define DMA_TCD_ATTR_DMOD_MASK              DMA_TCD_TCD0_ATTR_DMOD_MASK
#define DMA_TCD_ATTR_DMOD_SHIFT             DMA_TCD_TCD0_ATTR_DMOD_SHIFT
#define DMA_TCD_ATTR_DMOD(x)                DMA_TCD_TCD0_ATTR_DMOD(x)

#define DMA_TCD_ATTR_SSIZE_MASK             DMA_TCD_TCD0_ATTR_SSIZE_MASK
#define DMA_TCD_ATTR_SSIZE_SHIFT            DMA_TCD_TCD0_ATTR_SSIZE_SHIFT
#define DMA_TCD_ATTR_SSIZE(x)               DMA_TCD_TCD0_ATTR_SSIZE(x)

#define DMA_TCD_ATTR_SMOD_MASK              DMA_TCD_TCD0_ATTR_SMOD_MASK
#define DMA_TCD_ATTR_SMOD_SHIFT             DMA_TCD_TCD0_ATTR_SMOD_SHIFT
#define DMA_TCD_ATTR_SMOD(x)                DMA_TCD_TCD0_ATTR_SMOD(x)
/*! @} */

/*! @name TCD_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK  DMA_TCD_TCD0_NBYTES_MLOFFNO_NBYTES_MASK
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFNO_NBYTES_SHIFT
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES(x)    DMA_TCD_TCD0_NBYTES_MLOFFNO_NBYTES(x)

#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK   DMA_TCD_TCD0_NBYTES_MLOFFNO_DMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT  DMA_TCD_TCD0_NBYTES_MLOFFNO_DMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE(x)     DMA_TCD_TCD0_NBYTES_MLOFFNO_DMLOE(x)

#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK   DMA_TCD_TCD0_NBYTES_MLOFFNO_SMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT  DMA_TCD_TCD0_NBYTES_MLOFFNO_SMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE(x)     DMA_TCD_TCD0_NBYTES_MLOFFNO_SMLOE(x)
/*! @} */

/*! @name TCD_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_NBYTES_MASK
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_NBYTES_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_NBYTES(x)

#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_MLOFF_MASK
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_MLOFF_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_MLOFF(x)

#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_DMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_DMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_DMLOE(x)

#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_SMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_SMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_SMLOE(x)
/*! @} */

/*! @name TCD_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define DMA_TCD_SLAST_SDA_SLAST_SDA_MASK    DMA_TCD_TCD0_SLAST_SDA_SLAST_SDA_MASK
#define DMA_TCD_SLAST_SDA_SLAST_SDA_SHIFT   DMA_TCD_TCD0_SLAST_SDA_SLAST_SDA_SHIFT
#define DMA_TCD_SLAST_SDA_SLAST_SDA(x)      DMA_TCD_TCD0_SLAST_SDA_SLAST_SDA(x)
/*! @} */

/*! @name TCD_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD_DADDR_DADDR_MASK            DMA_TCD_TCD0_DADDR_DADDR_MASK
#define DMA_TCD_DADDR_DADDR_SHIFT           DMA_TCD_TCD0_DADDR_DADDR_SHIFT
#define DMA_TCD_DADDR_DADDR(x)              DMA_TCD_TCD0_DADDR_DADDR(x)
/*! @} */

/*! @name TCD_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD_DOFF_DOFF_MASK              DMA_TCD_TCD0_DOFF_DOFF_MASK
#define DMA_TCD_DOFF_DOFF_SHIFT             DMA_TCD_TCD0_DOFF_DOFF_SHIFT
#define DMA_TCD_DOFF_DOFF(x)                DMA_TCD_TCD0_DOFF_DOFF(x)
/*! @} */

/*! @name TCD_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD_CITER_ELINKNO_CITER_MASK    DMA_TCD_TCD0_CITER_ELINKNO_CITER_MASK
#define DMA_TCD_CITER_ELINKNO_CITER_SHIFT   DMA_TCD_TCD0_CITER_ELINKNO_CITER_SHIFT
#define DMA_TCD_CITER_ELINKNO_CITER(x)      DMA_TCD_TCD0_CITER_ELINKNO_CITER(x)

#define DMA_TCD_CITER_ELINKNO_ELINK_MASK    DMA_TCD_TCD0_CITER_ELINKNO_ELINK_MASK
#define DMA_TCD_CITER_ELINKNO_ELINK_SHIFT   DMA_TCD_TCD0_CITER_ELINKNO_ELINK_SHIFT
#define DMA_TCD_CITER_ELINKNO_ELINK(x)      DMA_TCD_TCD0_CITER_ELINKNO_ELINK(x)
/*! @} */

/*! @name TCD_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD_CITER_ELINKYES_CITER_MASK  DMA_TCD_TCD0_CITER_ELINKYES_CITER_MASK
#define DMA_TCD_CITER_ELINKYES_CITER_SHIFT DMA_TCD_TCD0_CITER_ELINKYES_CITER_SHIFT
#define DMA_TCD_CITER_ELINKYES_CITER(x)    DMA_TCD_TCD0_CITER_ELINKYES_CITER(x)

#define DMA_TCD_CITER_ELINKYES_LINKCH_MASK  DMA_TCD_TCD0_CITER_ELINKYES_LINKCH_MASK
#define DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT DMA_TCD_TCD0_CITER_ELINKYES_LINKCH_SHIFT
#define DMA_TCD_CITER_ELINKYES_LINKCH(x)    DMA_TCD_TCD0_CITER_ELINKYES_LINKCH(x)

#define DMA_TCD_CITER_ELINKYES_ELINK_MASK  DMA_TCD_TCD0_CITER_ELINKYES_ELINK_MASK
#define DMA_TCD_CITER_ELINKYES_ELINK_SHIFT DMA_TCD_TCD0_CITER_ELINKYES_ELINK_SHIFT
#define DMA_TCD_CITER_ELINKYES_ELINK(x)    DMA_TCD_TCD0_CITER_ELINKYES_ELINK(x)
/*! @} */

